import string
from random import random

# 定义一个包含汉字的字典
chinese_dict = {
    '1': '一', '2': '二', '3': '三', '4': '四', '5': '五', '6': '六', '7': '七', '8': '八', '9': '九',
    '0': '零', 'A': '啊', 'B': '吧', 'C': '擦', 'D': '的', 'E': '饿', 'F': '分', 'G': '个', 'H': '哈',
    'J': '家', 'K': '看', 'L': '了', 'M': '们', 'N': '呢', 'P': '怕', 'Q': '七', 'R': '人', 'S': '是',
    'T': '他', 'W': '我', 'X': '西', 'Y': '也', 'Z': '再',
    'a': '啊', 'b': '吧', 'c': '擦', 'd': '的', 'e': '饿', 'f': '分', 'g': '个', 'h': '哈',
    'j': '家', 'k': '看', 'l': '了', 'm': '们', 'n': '呢', 'p': '怕', 'q': '七', 'r': '人', 's': '是',
    't': '他', 'w': '我', 'x': '西', 'y': '也', 'z': '再'
}


# 生成随机汉字的2位或3位组合
def generate_random_chinese(length=2):
    # 生成随机索引
    index1 = random.randint(0, len(chinese_dict) - 1)
    index2 = random.randint(0, len(chinese_dict) - 1)
